---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.LegendComponentLength
source: html/34a23393-f73d-4c82-d27c-99b31d31eadf.htm
---
# Autodesk.Revit.DB.ParameterTypeId.LegendComponentLength Property

"Host Length"

## Syntax (C#)
```csharp
public static ForgeTypeId LegendComponentLength { get; }
```